---
kind: method
id: M:Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.#ctor(Autodesk.Revit.DB.Structure.StructuralMaterialType)
source: html/27989497-1489-7b17-6c3f-ec5fe924ff77.htm
---
# Autodesk.Revit.DB.Structure.StructuralMaterialTypeFilter.#ctor Method

Constructs a new instance of a filter to match family instances that have the given structural material type.

## Syntax (C#)
```csharp
public StructuralMaterialTypeFilter(
	StructuralMaterialType structuralMaterialType
)
```

## Parameters
- **structuralMaterialType** (`Autodesk.Revit.DB.Structure.StructuralMaterialType`) - The structural material type to match.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - A value passed for an enumeration argument is not a member of that enumeration